In [1]:
import pandas as pd
df_titanic = pd.read_csv('data/titanic.csv')
df = df_titanic

In [2]:
%who

df	 df_titanic	 pd

In [3]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [80]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [57]:
new_df = df[['Name','Pclass','Sex','Age','SibSp','Parch','Fare','Survived']]

In [79]:
new_df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Survived
0       3    1  22.0      1      0   7.2500         0
1       1    0  38.0      1      0  71.2833         1
2       3    0  26.0      0      0   7.9250         1
3       1    0  35.0      1      0  53.1000         1
4       3    1  35.0      0      0   8.0500         0

In [59]:
new_df['Initial']=0
for i in new_df:
    new_df['Initial']=new_df.Name.str.extract('([A-Za-z]+)\.') #extracting Name initials

/home/aayush/anaconda3/envs/fuseenv/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/home/aayush/anaconda3/envs/fuseenv/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [60]:
new_df['Initial'].replace(['Mlle','Mme','Ms','Dr','Major','Lady','Countess',
                               'Jonkheer','Col','Rev','Capt','Sir','Don'],['Miss',
                                'Miss','Miss','Mr','Mr','Mrs','Mrs','Other','Other','Other','Mr','Mr','Mr'],inplace=True)

/home/aayush/anaconda3/envs/fuseenv/lib/python3.7/site-packages/pandas/core/generic.py:6619: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [61]:
new_df.isnull().sum()

Name          0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Survived      0
Initial       0
dtype: int64

In [62]:
new_df.loc[(new_df.Age.isnull()) & (new_df.Initial=='Mr'),'Age']=33
new_df.loc[(new_df.Age.isnull()) & (new_df.Initial=='Mrs'),'Age']=36
new_df.loc[(new_df.Age.isnull()) & (new_df.Initial=='Master'),'Age']=5
new_df.loc[(new_df.Age.isnull()) & (new_df.Initial=='Miss'),'Age']=22
new_df.loc[(new_df.Age.isnull()) & (new_df.Initial=='Other'),'Age']=46

/home/aayush/anaconda3/envs/fuseenv/lib/python3.7/site-packages/pandas/core/indexing.py:1817: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [63]:
new_df.drop(['Name','Initial'],axis='columns',inplace=True)

/home/aayush/anaconda3/envs/fuseenv/lib/python3.7/site-packages/pandas/core/frame.py:4913: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [64]:
new_df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Survived    0
dtype: int64

In [65]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       891 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Survived  891 non-null    int64
dtypes: float64(2), int64(4), object(1)
memory usage: 48.9+ KB

In [51]:
# df.select_dtypes('object')

In [66]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
new_df['Sex'] = label_encoder.fit_transform(new_df['Sex'])

/home/aayush/anaconda3/envs/fuseenv/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [67]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    int64
 2   Age       891 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Survived  891 non-null    int64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

In [68]:
new_df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Survived
0       3    1  22.0      1      0   7.2500         0
1       1    0  38.0      1      0  71.2833         1
2       3    0  26.0      0      0   7.9250         1
3       1    0  35.0      1      0  53.1000         1
4       3    1  35.0      0      0   8.0500         0

In [69]:
X = new_df.drop('Survived',axis='columns')
y = new_df.Survived

In [70]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [71]:
X.shape, X_train.shape,X_test.shape

((891, 6), (712, 6), (179, 6))

In [72]:
X_train

     Pclass  Sex   Age  SibSp  Parch      Fare
30        1    1  40.0      0      0   27.7208
10        3    0   4.0      1      1   16.7000
873       3    1  47.0      0      0    9.0000
182       3    1   9.0      4      2   31.3875
876       3    1  20.0      0      0    9.8458
..      ...  ...   ...    ...    ...       ...
534       3    0  30.0      0      0    8.6625
584       3    1  33.0      0      0    8.7125
493       1    1  71.0      0      0   49.5042
527       1    1  33.0      0      0  221.7792
168       1    1  33.0      0      0   25.9250

[712 rows x 6 columns]

In [73]:
from sklearn.naive_bayes import GaussianNB

In [74]:
model = GaussianNB()

In [75]:
model.fit(X_train,y_train)

GaussianNB()

In [76]:
model.score(X_test,y_test)

0.7597765363128491

In [77]:
X_test[:10]

     Pclass  Sex   Age  SibSp  Parch      Fare
707       1    1  42.0      0      0   26.2875
37        3    1  21.0      0      0    8.0500
615       2    0  24.0      1      2   65.0000
169       3    1  28.0      0      0   56.4958
68        3    0  17.0      4      2    7.9250
606       3    1  30.0      0      0    7.8958
630       1    1  80.0      0      0   30.0000
785       3    1  25.0      0      0    7.2500
660       1    1  50.0      2      0  133.6500
728       2    1  25.0      1      0   26.0000

In [78]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 0, 0, 0, 0, 1, 0])

In [81]:
model.predict_proba(X_test[:10])

array([[7.47842302e-01, 2.52157698e-01],
       [9.45055496e-01, 5.49445039e-02],
       [6.88131435e-02, 9.31186856e-01],
       [9.06470573e-01, 9.35294267e-02],
       [9.99835748e-01, 1.64251703e-04],
       [9.53586962e-01, 4.64130381e-02],
       [5.70131523e-01, 4.29868477e-01],
       [9.49322531e-01, 5.06774692e-02],
       [4.09901060e-02, 9.59009894e-01],
       [9.08643826e-01, 9.13561740e-02]])

In [82]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5) # For Cross Validation

array([0.84615385, 0.77622378, 0.77464789, 0.80985915, 0.76056338])